import SectionTitle from "../../components/UIElements/SectionTitle";
import AppItem from "./AppItem";

const Apps = () => {
  return (
    <div className="flex flex-col gap-14">
    <div className=" flex justify-center items-center  h-96 rounded-lg bg-blend-overlay bg-black bg-opacity-60  overflow-hidden bg-[url('https://www.tatbiqati.com/images/news/1687743315.webp')]">
      <h1 className="text-7xl font-bold text-white"> متجر التطبيقات </h1>
    </div>

      <div>
      <SectionTitle title={"التطبيقات المثبتة"} />
      <div className="px-2 p-5 lg:p-10 grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 gap-4 lg:gap-6  bg-white rounded-md ">
        <AppItem
          app={{
            danger: true,
            title: "تطبيق المراجعات ",
            des: "مراجعات علي المنتجات الخاصة بمتجرك مما يزيد من النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي نص ",
          }}
        />
        <AppItem
          app={{
            danger: true,
            title: "تطبيق المراجعات ",
            des: "مراجعات علي المنتجات الخاصة بمتجرك مما يزيد من النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي نص ",
          }}
        />
        <AppItem
          app={{
            danger: true,
            title: "تطبيق المراجعات ",
            des: "مراجعات علي المنتجات الخاصة بمتجرك مما يزيد من النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي نص ",
          }}
        />
       <AppItem
          app={{
            danger: true,
            title: "تطبيق المراجعات ",
            des: "مراجعات علي المنتجات الخاصة بمتجرك مما يزيد من النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي نص ",
          }}
        />
       
      </div>
      </div>
       
      <div>
      <SectionTitle title={"التطبيقات المثبتة"} />
      <div className="px-2 p-5 lg:p-10 grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 gap-4 lg:gap-6  bg-white rounded-md ">
        <AppItem
          app={{
            danger: false,
            title: "تطبيق المراجعات ",
            des: "مراجعات علي المنتجات الخاصة بمتجرك مما يزيد من النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي نص ",
          }}
        />
        <AppItem
          app={{
            danger: false,
            title: "تطبيق المراجعات ",
            des: "مراجعات علي المنتجات الخاصة بمتجرك مما يزيد من النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي نص ",
          }}
        />
        <AppItem
          app={{
            danger: false,
            title: "تطبيق المراجعات ",
            des: "مراجعات علي المنتجات الخاصة بمتجرك مما يزيد من النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي نص ",
          }}
        />
       <AppItem
          app={{
            danger: false,
            title: "تطبيق المراجعات ",
            des: "مراجعات علي المنتجات الخاصة بمتجرك مما يزيد من النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي ن النص المثال علي نص ",
          }}
        />
       
      </div>


      
      </div>



    </div>
  );
};

export default Apps;
